{"id":113,"date":"2015-03-25T18:19:58","date_gmt":"2015-03-25T18:19:58","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=113"},"modified":"2020-05-12T12:55:50","modified_gmt":"2020-05-12T12:55:50","slug":"teaching-carolingian-chant-with-interactive-software-theory-application-and-assessment","status":"publish","type":"product","link":"https:\/\/codingplusfun.com\/page\/teaching-carolingian-chant-with-interactive-software-theory-application-and-assessment\/","title":{"rendered":"Teaching Carolingian Chant with Interactive Software: Theory, Application and Assessment"},"content":{"rendered":"<p>The science of teaching\/learning and the development of interactive technology are now at a stage where an effective interactive system can be developed for the teaching and learning of the basic vocabulary and grammar of early musical notation systems. Our interdisciplinary team is developing the first such system, in addition to the first assessment tool for evaluating the effectiveness of the system. We propose to offer a presentation session that will include the following: an explanation of the software and the learning research behind it; a demonstrate of the system; an explanation of the assessment process used to determine the effectiveness of the software; an audience participation segment in which audience members will see a short demonstration video regarding a particular segment of the notation work in self-correcting, interactive exercises take an online assessment. Participants in this presentation session will gain an understanding of the benefits of interactive learning; gain an understanding of an assessment process for an interactive learning that also provides a framework for ensuring an unbiased assessment; have an experience of a new interactive software, the principals behind which could be applied to various disciplines.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The science of teaching\/learning and the development of interactive technology are now at a stage where an effective interactive system can be developed for the teaching and learning of the basic vocabulary and grammar of early musical notation systems. Our interdisciplinary team is developing the first such system, in addition to the first assessment tool<span class=\"read-more-faq\"><a href=\"https:\/\/codingplusfun.com\/page\/teaching-carolingian-chant-with-interactive-software-theory-application-and-assessment\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":114,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/product\/113"}],"collection":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/comments?post=113"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/media\/114"}],"wp:attachment":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/media?parent=113"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}