{"id":127,"date":"2019-08-27T18:51:10","date_gmt":"2019-08-27T18:51:10","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=127"},"modified":"2020-09-04T21:17:42","modified_gmt":"2020-09-04T21:17:42","slug":"development-and-validation-of-the-automated-imaging-differentiation-in-parkinsonism-aid-p-a-multicentre-machine-learning-study","status":"publish","type":"product","link":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/development-and-validation-of-the-automated-imaging-differentiation-in-parkinsonism-aid-p-a-multicentre-machine-learning-study\/","title":{"rendered":"Development and validation of the automated imaging differentiation in parkinsonism (AID-P): a multicentre machine learning study"},"content":{"rendered":"<h3>Background<\/h3>\n<div class=\"section-paragraph\">Development of valid, non-invasive biomarkers for parkinsonian syndromes is crucially needed. We aimed to assess whether non-invasive diffusion-weighted MRI can distinguish between parkinsonian syndromes using an automated imaging approach.<\/div>\n<h3>Methods<\/h3>\n<div class=\"section-paragraph\">We did an international study at 17 MRI centres in Austria, Germany, and the USA. We used diffusion-weighted MRI from 1002 patients and the Movement Disorders Society Unified Parkinson&#8217;s Disease Rating Scale part III (MDS-UPDRS III) to develop and validate disease-specific machine learning comparisons using 60 template regions and tracts of interest in Montreal Neurological Institute space between Parkinson&#8217;s disease and atypical parkinsonism (multiple system atrophy and progressive supranuclear palsy) and between multiple system atrophy and progressive supranuclear palsy. For each comparison, models were developed on a training and validation cohort and evaluated in an independent test cohort by quantifying the area under the curve (AUC) of receiving operating characteristic curves. The primary outcomes were free water and free-water-corrected fractional anisotropy across 60 different template regions.<\/div>\n<h3>Findings<\/h3>\n<div class=\"section-paragraph\">In the test cohort for disease-specific comparisons, the diffusion-weighted MRI plus MDS-UPDRS III model (Parkinson&#8217;s disease <em>vs<\/em> atypical parkinsonism had an AUC 0·962; multiple system atrophy <em>vs<\/em> progressive supranuclear palsy AUC 0·897) and diffusion-weighted MRI only model had high AUCs (Parkinson&#8217;s disease <em>vs<\/em> atypical parkinsonism AUC 0·955; multiple system atrophy <em>vs<\/em> progressive supranuclear palsy AUC 0·926), whereas the MDS-UPDRS III only models had significantly lower AUCs (Parkinson&#8217;s disease <em>vs<\/em> atypical parkinsonism 0·775; multiple system atrophy <em>vs<\/em> progressive supranuclear palsy 0·582). These results indicate that a non-invasive imaging approach is capable of differentiating forms of parkinsonism comparable to current gold standard methods.<\/div>\n<h3>Interpretations<\/h3>\n<div class=\"section-paragraph\">This study provides an objective, validated, and generalisable imaging approach to distinguish different forms of parkinsonian syndromes using multisite diffusion-weighted MRI cohorts. The diffusion-weighted MRI method does not involve radioactive tracers, is completely automated, and can be collected in less than 12 min across 3T scanners worldwide. The use of this test could positively affect the clinical care of patients with Parkinson&#8217;s disease and parkinsonism and reduce the number of misdiagnosed cases in clinical trials.<\/div>\n<h3>Funding<\/h3>\n<div class=\"section-paragraph\">National Institutes of Health and Parkinson&#8217;s Foundation.<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Background Development of valid, non-invasive biomarkers for parkinsonian syndromes is crucially needed. We aimed to assess whether non-invasive diffusion-weighted MRI can distinguish between parkinsonian syndromes using an automated imaging approach. Methods We did an international study at 17 MRI centres in Austria, Germany, and the USA. We used diffusion-weighted MRI from 1002 patients and the<span class=\"read-more-faq\"><a href=\"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/development-and-validation-of-the-automated-imaging-differentiation-in-parkinsonism-aid-p-a-multicentre-machine-learning-study\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":128,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product\/127"}],"collection":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/comments?post=127"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media\/128"}],"wp:attachment":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media?parent=127"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}