{"id":135,"date":"2016-01-12T13:03:38","date_gmt":"2016-01-12T13:03:38","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=135"},"modified":"2020-05-07T13:05:13","modified_gmt":"2020-05-07T13:05:13","slug":"three-dimensional-modeling-of-trophy-largemouth-bass","status":"publish","type":"product","link":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/three-dimensional-modeling-of-trophy-largemouth-bass\/","title":{"rendered":"Three-dimensional modeling of trophy Largemouth Bass"},"content":{"rendered":"<p>Started in October 2012, the Trophy Catch program run by the Florida Fish and Wildlife Conservation Commission (FWC) has been used to encourage catch-and-release of the largest, oldest, and most valuable bass in Florida’s waters. A trophy bass is defined by the program as one that weighs greater than eight pounds. The Trophy Catch program provides incentives for anglers to serve as citizen scientists by properly recording data on their catch and submitting it online so that FWC can better enhance, conserve, and promote trophy bass fishing. Trophy Catch participants who successfully submit a “Hall of Fame” bass, which is a bass weighing greater than thirteen pounds receive a replica mount of their fish. The current process to create a replica mount requires taxidermists to have a collection of fish molds of similar length and girth to the fish the angler caught. The trophy fish used to make these molds are rare and must be sacrificed to make the mold. Most taxidermists’ collections consist of only a few molds. Our goals are to explore the suitability of three-dimensional (3D) modeling to capture the structure of a trophy Largemouth Bass and to assess the current limitations of the technology to produce models suitable for 3D printing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Started in October 2012, the Trophy Catch program run by the Florida Fish and Wildlife Conservation Commission (FWC) has been used to encourage catch-and-release of the largest, oldest, and most valuable bass in Florida’s waters. A trophy bass is defined by the program as one that weighs greater than eight pounds. The Trophy Catch program<span class=\"read-more-faq\"><a href=\"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/three-dimensional-modeling-of-trophy-largemouth-bass\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":136,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product\/135"}],"collection":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/comments?post=135"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media\/136"}],"wp:attachment":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media?parent=135"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}