{"id":143,"date":"2014-07-19T20:23:19","date_gmt":"2014-07-19T20:23:19","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=143"},"modified":"2020-05-11T15:34:49","modified_gmt":"2020-05-11T15:34:49","slug":"comparative-analysis-of-driving-maneuvers-using-3d-body-posture-data","status":"publish","type":"product","link":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/comparative-analysis-of-driving-maneuvers-using-3d-body-posture-data\/","title":{"rendered":"Comparative Analysis of Driving Maneuvers Using 3D Body Posture Data"},"content":{"rendered":"<p>Research has shown that driver inattention is the most prevalent cause of traffic collisions accounting for an estimated 25 to 56% of crashes in the US. Driver inattention may result from drivers engagement in secondary activities (such as texting or cell-phone use), or lack of awareness of the surrounding environment. The main objective of this research is to investigate the relationship between potentially unsafe driving events and the actual driver body posture and movements when performing a driving maneuver under different traffic configurations. The paper presents results from a pilot study that captured the 3-D posture and activity of three drivers while performing both mandatory (merging) and discretionary (lane changing) maneuvers on freeway and arterial segments in Gainesville, Florida. The body posture of the drivers was captured through the use of a low-cost infrared depth sensor. A 7-point human skeletal model was fit to the captured depth frame sequences using our proposed framework. The comparative analysis of the participants&#8217; body movements while performing the maneuvers revealed differences between the participants&#8217; body activity when performing the same maneuvers. The findings of this research provide significant insights regarding which body movements may hide unsafe situations while performing a driving maneuver that requires the attention of the surrounding environment.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Research has shown that driver inattention is the most prevalent cause of traffic collisions accounting for an estimated 25 to 56% of crashes in the US. Driver inattention may result from drivers engagement in secondary activities (such as texting or cell-phone use), or lack of awareness of the surrounding environment. The main objective of this<span class=\"read-more-faq\"><a href=\"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/comparative-analysis-of-driving-maneuvers-using-3d-body-posture-data\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":212,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product\/143"}],"collection":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/comments?post=143"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media\/212"}],"wp:attachment":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media?parent=143"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}