{"id":147,"date":"2014-01-07T20:53:36","date_gmt":"2014-01-07T20:53:36","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=147"},"modified":"2020-05-09T13:25:32","modified_gmt":"2020-05-09T13:25:32","slug":"perpendicular-fiber-tracking-for-neural-fiber-bundle-analysis-using-diffusion-mri","status":"publish","type":"product","link":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/perpendicular-fiber-tracking-for-neural-fiber-bundle-analysis-using-diffusion-mri\/","title":{"rendered":"Perpendicular Fiber Tracking for Neural Fiber Bundle Analysis using Diffusion MRI"},"content":{"rendered":"<p>Information on the directionality and structure of axonal fibers in neural tissue can be obtained by analyzing Diffusion-Weighted MRI datasets. Several fiber tracking algorithms have been presented in literature that trace the underlying field of principal orientations of water diffusion, which correspond to the local primary eigenvectors of the diffusion tensor field. However, the majority of the existing techniques ignore the secondary and tertiary orientations of diffusion, which contain significant information on the local patterns of diffusion. In this paper we introduce the idea of perpendicular fiber tracking and we present a novel dynamic programming method that traces surfaces, which are locally perpendicular to the axonal fibers. This is achieved by using a cost function, with geometric and fiber orientation constraints, that is evaluated dynamically for every voxel in the image domain starting from a given seed point. The proposed method is tested using synthetic and real DW-MRI datasets. The results conclusively demonstrate the accuracy and effectiveness of our method.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Information on the directionality and structure of axonal fibers in neural tissue can be obtained by analyzing Diffusion-Weighted MRI datasets. Several fiber tracking algorithms have been presented in literature that trace the underlying field of principal orientations of water diffusion, which correspond to the local primary eigenvectors of the diffusion tensor field. However, the majority<span class=\"read-more-faq\"><a href=\"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/perpendicular-fiber-tracking-for-neural-fiber-bundle-analysis-using-diffusion-mri\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":180,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product\/147"}],"collection":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/comments?post=147"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media\/180"}],"wp:attachment":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media?parent=147"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}