{"id":148,"date":"2020-05-03T20:56:49","date_gmt":"2020-05-03T20:56:49","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=148"},"modified":"2020-09-06T16:17:29","modified_gmt":"2020-09-06T16:17:29","slug":"discover-davinci-a-gamified-blockchain-learning-app","status":"publish","type":"product","link":"https:\/\/abarmpou.github.io/angelos\/page\/discover-davinci-a-gamified-blockchain-learning-app\/","title":{"rendered":"Discover DaVinci – A Gamified Blockchain Learning App"},"content":{"rendered":"<p>Discover DaVinci is a novel augmented reality system that incorporates blockchain technology with experiential learning to engage participants in an interactive discovery of Leonardo da Vinci’s ouvre. In the true spirit of this “Renaissance man”, Discover DaVinci explores new ideas and technologies “ahead of their time”.<\/p>\n<p>In order to illustrate the emerging potential at the intersection of art and blockchain, we present a case study of a new interactive system produced at the University of Florida Digital Worlds Institute.<\/p>\n<p><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/0uKWQFqtIuA?feature=oembed\" width=\"800\" height=\"600\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"><\/iframe><\/p>\n<p>The technologies of mobile computing, augmented reality (AR), and blockchain are starting to merge, creating new opportunities and scenarios to interact with our environment. In AR we can look at virtual objects superimposed within a real environment and resize them, rotate them, explore and interact with them on multiple levels. With the combination of AR and blockchain, we can create a system capable of keeping track of digital assets located virtually in 3D space (i.e., spatial computing). The global scale of blockchain and related technologies heightens the potential for trade and digital distribution with a fully automated and trusted way to keep track of their creations without a “middle-man”.<\/p>\n<p>Discover DaVinci is a novel educational tool that teaches concepts of blockchain technology through an augmented reality experiential learning game.<\/p>\n<p>This project was developed in collaboration with several units from the University of Florida and industry partners:<br \/>\n• Digital Arts &amp; Sciences Faculty (Computer Science and Digital Worlds Institute)<br \/>\n• Digital Worlds Studios’ Artists and Programmers<br \/>\n• Gator Blockchain Club (gatorblockchainclub.com) – Student-run blockchain club at the University of Florida<br \/>\n• Center for Innovation and Entrepreneurship (College of Business)<br \/>\n• Creative Campus Committee at the University of Florida<br \/>\nIndustry Partners:<br \/>\n• DLUX, decentralized content network (dlux.io)<br \/>\n• Steem (steem.com), and Steemit (steemit.com)<br \/>\n• A-Frame, web VR platform (aframe.io)<\/p>\n<p>Discover DaVinci utilizes the format of a digital, collectible trading &amp; drafting card game with AR elements on the STEEM blockchain. Although each player “owns” their cards, all transactions are public. Every collectible card is a unique token, owned by the player – a digital asset registered to the player’s account. The aim is to draw new question cards daily, answer the questions about Leonardo DaVinci, collect the special AR invention cards, and ultimately submit the accumulated card collection into a drawing for prizes. The app was developed to honor the 500th anniversary of Leonardo Davinci by promoting new and innovative technologies.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Discover DaVinci is a novel augmented reality system that incorporates blockchain technology with experiential learning to engage participants in an interactive discovery of Leonardo da Vinci’s ouvre. In the true spirit of this “Renaissance man”, Discover DaVinci explores new ideas and technologies “ahead of their time”. In order to illustrate the emerging potential at the<span class=\"read-more-faq\"><a href=\"https:\/\/abarmpou.github.io/angelos\/page\/discover-davinci-a-gamified-blockchain-learning-app\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":149,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product\/148"}],"collection":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/comments?post=148"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media\/149"}],"wp:attachment":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media?parent=148"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}