{"id":153,"date":"2012-08-08T12:42:52","date_gmt":"2012-08-08T12:42:52","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=153"},"modified":"2020-05-09T13:33:49","modified_gmt":"2020-05-09T13:33:49","slug":"symmetric-positive-definite-cartesian-tensor-fiber-orientation-distributions-ct-fod","status":"publish","type":"product","link":"https:\/\/codingplusfun.com\/page\/symmetric-positive-definite-cartesian-tensor-fiber-orientation-distributions-ct-fod\/","title":{"rendered":"Symmetric positive-definite Cartesian tensor fiber orientation distributions (CT-FOD)"},"content":{"rendered":"<p>A novel method for estimating a field of fiber orientation distribution (FOD) based on signal de-convolution from a given set of diffusion weighted magnetic resonance (DW-MR) images is presented. We model the FOD by higher order Cartesian tensor basis using a parametrization that explicitly enforces the positive semi-definite property to the computed FOD. The computed Cartesian tensors, dubbed Cartesian Tensor-FOD (CT-FOD), are symmetric positive semi-definite tensors whose coefficients can be efficiently estimated by solving a linear system with non-negative constraints. Next, we show how to use our method for converting higher-order diffusion tensors to CT-FODs, which is an essential task since the maxima of higher-order tensors do not correspond to the underlying fiber orientations. Finally, we propose a diffusion anisotropy index computed directly from CT-FODs using higher order tensor distance measures thus consolidating the whole analysis pipeline of diffusion imaging solely using CT-FODs. We evaluate our method qualitatively and quantitatively using simulated DW-MR images, phantom images, and human brain real dataset. The results conclusively demonstrate the superiority of the proposed technique over several existing multifiber reconstruction methods.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A novel method for estimating a field of fiber orientation distribution (FOD) based on signal de-convolution from a given set of diffusion weighted magnetic resonance (DW-MR) images is presented. We model the FOD by higher order Cartesian tensor basis using a parametrization that explicitly enforces the positive semi-definite property to the computed FOD. The computed<span class=\"read-more-faq\"><a href=\"https:\/\/codingplusfun.com\/page\/symmetric-positive-definite-cartesian-tensor-fiber-orientation-distributions-ct-fod\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":182,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/product\/153"}],"collection":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/comments?post=153"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/media\/182"}],"wp:attachment":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/media?parent=153"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}