{"id":158,"date":"2009-03-08T17:41:43","date_gmt":"2009-03-08T17:41:43","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=158"},"modified":"2020-05-09T19:19:35","modified_gmt":"2020-05-09T19:19:35","slug":"regularized-positive-definite-fourth-order-tensor-field-estimation-from-dw-mri","status":"publish","type":"product","link":"https:\/\/codingplusfun.com\/page\/regularized-positive-definite-fourth-order-tensor-field-estimation-from-dw-mri\/","title":{"rendered":"Regularized Positive-Definite Fourth-Order Tensor Field Estimation from DW-MRI"},"content":{"rendered":"<p>In Diffusion Weighted Magnetic Resonance Image (DW-MRI) processing, a 2nd order tensor has been commonly used to approximate the diffusivity function at each lattice point of the DW-MRI data. From this tensor approximation, one can compute useful scalar quantities (e.g. anisotropy, mean diffusivity) which have been clinically used for monitoring encephalopathy, sclerosis, ischemia and other brain disorders. It is now well known that this 2nd-order tensor approximation fails to capture complex local tissue structures, e.g. crossing fibers, and as a result the scalar quantities derived from these tensors are grossly inaccurate at such locations. In this paper we employ a 4th order symmetric positive-definite (SPD) tensor approximation to represent the diffusivity function and present a novel technique to estimate these tensors from the DW-MRI data guaranteeing the SPD property. Several articles have been reported in literature on higher order tensor approximations of the diffusivity function but none of them guarantee the positivity of the estimates, which is a fundamental constraint since negative values of the diffusivity are not meaningful. In this paper we represent the 4th-order tensors as ternary quartics and then apply Hilbert&#8217;s theorem on ternary quartics along with the Iwasawa parametrization to guarantee an SPD 4th-order tensor approximation from the DW-MRI data. The performance of this model is depicted on synthetic data as well as real DW-MRIs from a set of excised control and injured rat spinal cords, showing accurate estimation of scalar quantities such as generalized anisotropy and trace as well as fiber orientations.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In Diffusion Weighted Magnetic Resonance Image (DW-MRI) processing, a 2nd order tensor has been commonly used to approximate the diffusivity function at each lattice point of the DW-MRI data. From this tensor approximation, one can compute useful scalar quantities (e.g. anisotropy, mean diffusivity) which have been clinically used for monitoring encephalopathy, sclerosis, ischemia and other<span class=\"read-more-faq\"><a href=\"https:\/\/codingplusfun.com\/page\/regularized-positive-definite-fourth-order-tensor-field-estimation-from-dw-mri\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":192,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/product\/158"}],"collection":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/comments?post=158"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/media\/192"}],"wp:attachment":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/media?parent=158"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}