{"id":163,"date":"2009-05-08T18:10:57","date_gmt":"2009-05-08T18:10:57","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=163"},"modified":"2020-05-09T19:16:59","modified_gmt":"2020-05-09T19:16:59","slug":"information-theoretic-methods-for-diffusion-weighted-mri-analysis","status":"publish","type":"product","link":"https:\/\/abarmpou.github.io/angelos\/page\/information-theoretic-methods-for-diffusion-weighted-mri-analysis\/","title":{"rendered":"Information theoretic methods for diffusion-weighted MRI analysis"},"content":{"rendered":"<p>Concepts from Information Theory have been used quite widely in Image Processing, Computer Vision and Medical Image Analysis for several decades now. Most widely used concepts are that of KL-divergence, minimum description length (MDL), etc. These concepts have been popularly employed for image registration, segmentation, classification etc. In this chapter we review several methods, mostly developed by our group at the Center for Vision, Graphics &#038; Medical Imaging in the University of Florida, that glean concepts from Information Theory and apply them to achieve analysis of Diffusion-Weighted Magnetic Resonance (DW-MRI) data. This relatively new MRI modality allows one to non-invasively infer axonal connectivity patterns in the central nervous system. The focus of this chapter is to review automated image analysis techniques that allow us to automatically segment the region of interest in the DWMRI image wherein one might want to track the axonal pathways and also methods to reconstruct complex local tissue geometries containing axonal fiber crossings. Implementation results illustrating the algorithm application to real DW-MRI data sets are depicted to demonstrate the effectiveness of the methods reviewed.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Concepts from Information Theory have been used quite widely in Image Processing, Computer Vision and Medical Image Analysis for several decades now. Most widely used concepts are that of KL-divergence, minimum description length (MDL), etc. These concepts have been popularly employed for image registration, segmentation, classification etc. In this chapter we review several methods, mostly<span class=\"read-more-faq\"><a href=\"https:\/\/abarmpou.github.io/angelos\/page\/information-theoretic-methods-for-diffusion-weighted-mri-analysis\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":191,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product\/163"}],"collection":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/comments?post=163"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media\/191"}],"wp:attachment":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media?parent=163"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}