{"id":165,"date":"2008-09-06T18:32:24","date_gmt":"2008-09-06T18:32:24","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=165"},"modified":"2020-05-09T13:17:18","modified_gmt":"2020-05-09T13:17:18","slug":"extracting-tractosemas-from-a-displacement-probability-field-for-tractography-in-dw-mri","status":"publish","type":"product","link":"https:\/\/abarmpou.github.io/angelos\/page\/extracting-tractosemas-from-a-displacement-probability-field-for-tractography-in-dw-mri\/","title":{"rendered":"Extracting Tractosemas from a displacement probability field for tractography in DW-MRI"},"content":{"rendered":"<p>In this paper we present a novel method for estimating a field of asymmetric spherical functions, dubbed tractosemas, given the intra-voxel displacement probability information. The peaks of tractosemas correspond to directions of distinct fibers, which can have either symmetric or asymmetric local fiber structure. This is in contrast to the existing methods that estimate fiber orientation distributions which are naturally symmetric and therefore cannot model asymmetries such as splaying fibers. We propose a method for extracting tractosemas from a given field of displacement probability iso-surfaces via a diffusion process. The diffusion is performed by minimizing a kernel convolution integral, which leads to an update formula expressed in the convenient form of a discrete kernel convolution. The kernel expresses the probability of diffusion between two neighboring spherical functions and we model it by the product of Gaussian and von-Mises distributions. The robustness of our model in estimating accurate fiber orientations is validated via experiments on synthetic and real diffusion-weighted magnetic resonance (DW-MRI) datasets from an isolated rat hippocampus and a cats spinal cord.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this paper we present a novel method for estimating a field of asymmetric spherical functions, dubbed tractosemas, given the intra-voxel displacement probability information. The peaks of tractosemas correspond to directions of distinct fibers, which can have either symmetric or asymmetric local fiber structure. This is in contrast to the existing methods that estimate fiber<span class=\"read-more-faq\"><a href=\"https:\/\/abarmpou.github.io/angelos\/page\/extracting-tractosemas-from-a-displacement-probability-field-for-tractography-in-dw-mri\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":179,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product\/165"}],"collection":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/comments?post=165"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media\/179"}],"wp:attachment":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media?parent=165"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}