{"id":222,"date":"2020-05-02T18:30:26","date_gmt":"2020-05-02T18:30:26","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=222"},"modified":"2020-07-17T17:44:51","modified_gmt":"2020-07-17T17:44:51","slug":"word-work-mat-app-for-literacy-instruction","status":"publish","type":"product","link":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/word-work-mat-app-for-literacy-instruction\/","title":{"rendered":"Word Work Mat App for literacy instruction"},"content":{"rendered":"<p><iframe loading=\"lazy\" src=\"https:\/\/www.youtube.com\/embed\/CPgzP6SXouk?feature=oembed\" width=\"1200\" height=\"600\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"><span data-mce-type=\"bookmark\" style=\"display: inline-block; width: 0px; overflow: hidden; line-height: 0;\" class=\"mce_SELRES_start\">﻿<\/span><\/iframe><\/p>\n<p>During the COVID-19 pandemic, education has been severely impacted across the globe.<br \/>\nOngoing class sessions are especially important for K-12 students, many of whom benefit<br \/>\nespecially from experiential learning that is not typically offered in ad hoc online settings. UF<br \/>\nDigital Worlds Institute professor Angelos Barmpoutis is working in partnership with the UF<br \/>\nLiteracy Institute (UFLI) to address this world-wide need with an innovative virtual platform<br \/>\nsolution.<\/p>\n<p>The Virtual Word Work Mat (VWWM) is an interactive app designed for literacy instruction,<br \/>\nbased on the original physical classroom version of the Word Work Mat created by UF doctoral<br \/>\nstudent Valentina Contesse. Valentina stated, “I never imagined when I was making Word Work<br \/>\nMats for my first graders, using file folders and Velcro, that it could be transformed into a<br \/>\ndigital tool that teachers all over the world would use in their classrooms!”<\/p>\n<p>According to Facebook analytics, just two days after its release date the VWWM had already<br \/>\nreached more than 70,000 people, with more than 6,000 engagements and 300 shares. And<br \/>\nUFLI’s online engagement increased by more than 1000 subscriptions during the same period.<br \/>\nCreating and offering ready access to the Virtual Word Work Mat during pandemic lockdown<br \/>\nhas empowered teachers and students continue their literacy instruction as part of their on-line<br \/>\nlearning activities. Designed to work on tablet and other devices using the either iOS or Android<br \/>\nplatforms, VWWM provides a simple user interface in which students can manipulate letter and<br \/>\nphoneme cards with intuitive touch gestures and compose words at home.<\/p>\n<p>Holly Lane, Director of UFLI said, “We’re so excited about the partnership between the UF<br \/>\nLiteracy Institute and Digital Worlds in our response to the pandemic. Thanks to the<br \/>\ncommitment and technical expertise of Angelos Barmpoutis, we were able to take some our<br \/>\ninteractive literacy instruction materials and bring them to life on a virtual platform. The<br \/>\nresponse from teachers has been overwhelmingly positive. We have many thousands of<br \/>\nteachers accessing the materials and sharing the links on social media.”<\/p>\n<p>This excitement is shared by Digital Worlds Director James Oliverio. “One of the great benefits<br \/>\nof experiential online learning is accessibility across the traditional challenges of demographics,<br \/>\ngeography, and time zones. This project is an example of the interdisciplinary strengths of the<br \/>\nUniversity of Florida; faculty stepping up in a time of need to provide tangible benefits from the<br \/>\nongoing research and development happening across our campus.”<\/p>\n<p>UFLI Director Lane also stated, “Together, UFLI and DW are making a difference for teachers<br \/>\nand their students. We hope this is just the beginning of our collaboration!”<\/p>\n<p><strong>Sample Comments from Parents and Teachers:<\/strong><\/p>\n<p>&#8220;I used this for the first time yesterday in my virtual reading lesson with my struggling readers.<br \/>\nTheir response was priceless. They were so engaged and actively asking me to change the<br \/>\nletters and make new words”<\/p>\n<p>&#8220;This has been amazing for my daughter with a severe Auditory Processing Disorder and<br \/>\ndysgraphia. Thank you!!!&#8221;<\/p>\n<p>&#8220;This is amazing— thank you! Can’t wait to share with my teachers!&#8221;<\/p>\n<p>&#8220;This is immeasurably helpful!!!!&#8221;<\/p>\n<p><strong>Press Release by the UF College of the Arts:<\/strong><\/p>\n<p><a href=\"https:\/\/arts.ufl.edu\/in-the-loop\/news\/digital-worlds-institute-researcher-creates-experiential-online-learning-app\/\">https:\/\/arts.ufl.edu\/in-the-loop\/news\/digital-worlds-institute-researcher-creates-experiential-online-learning-app\/<\/a><\/p>\n<p><strong>Links to the App:<\/strong><\/p>\n<p>Try the Virtual Word Work Mats below:<\/p>\n<p><strong>Beginner Word Work Mat<\/strong><br \/>\nDirect link: <a href=\"https:\/\/research.dwi.ufl.edu\/op.n\/file\/cbhd8xmn9i4ctf7i\/embed\">Beginner Word Work Mat<\/a><br \/>\nDrag and drop the letter cards below:<br \/>\n<iframe loading=\"lazy\" src=\"https:\/\/research.dwi.ufl.edu\/op.n\/file\/cbhd8xmn9i4ctf7i\/embed\" width=\"1200px\" height=\"600px\" frameborder=\"0\" scrolling=\"no\"><\/iframe><\/p>\n<p><strong>Intermediate Word Work Mat<\/strong><br \/>\nDirect link: <a href=\"https:\/\/research.dwi.ufl.edu\/op.n\/file\/gc8nkxns914enc7d\/embed\">Intermediate Word Work Mat<\/a>.<br \/>\nDrag and drop the letter cards below:<br \/>\n<iframe loading=\"lazy\" src=\"https:\/\/research.dwi.ufl.edu\/op.n\/file\/gc8nkxns914enc7d\/embed\" width=\"1200px\" height=\"600px\" frameborder=\"0\" scrolling=\"no\"><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The Virtual Word Work Mat is an interactive app designed for literacy instruction, based on the original physical classroom version. The app was released to the public during the COVID-19 pandemic, when many schools moved their K-12 classes to on-line sessions and their on-line instruction could benefit especially from experiential learning that is not typically offered in ad hoc online settings. Just two days after its release date the Virtual Word Work Mat app had already reached more than 70,000 people, with more than 6,000 engagements and 300 shares.<\/p>\n","protected":false},"featured_media":223,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product\/222"}],"collection":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/comments?post=222"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media\/223"}],"wp:attachment":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media?parent=222"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}