{"id":244,"date":"2015-10-06T20:54:03","date_gmt":"2015-10-06T20:54:03","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=244"},"modified":"2020-06-27T20:54:20","modified_gmt":"2020-06-27T20:54:20","slug":"analyzing-3d-body-posture-activity-during-merging-and-lane-changing-maneuvers","status":"publish","type":"product","link":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/analyzing-3d-body-posture-activity-during-merging-and-lane-changing-maneuvers\/","title":{"rendered":"Analyzing 3D Body Posture Activity during Merging and Lane Changing Maneuvers"},"content":{"rendered":"<p>Although significant advances have been done with respect to vehicle technology and roadway construction, driver behavior remains the number one contributing factor of traffic crashes worldwide. Studies show that one of the major causes of crashes is driver inattention. Driver inattention may occur when drivers are involved with secondary activities (e.g., texting, talking on the phone, or eating), and when they fail to follow the cues of the surrounding environment while driving.  The latter is particularly important when drivers are negotiating maneuvers and are required to interact with other vehicles as in the case of changing lanes or merging onto the freeway. The main objective of this research is to investigate the relationship between driver behavior and safety, by looking at the actual body movements and posture, as well as the eye fixation of the drivers when they are performing lane changing and merging maneuvers under different traffic conditions. To accomplish this objective, a total of 35 drivers were recruited to participate in an instrumented vehicle field study, where each participant drove for approximately two hours along a pre-selected route. Participants’ 3D body posture was recorded with the use of a low-cost infrared depth sensor (Microsoft Kinect). In addition, participants’ eye gaze throughout the entire data collection effort was recorded with the help of an eye-tracking equipment. Lastly, the vehicle was equipped with two cameras that faced the front and the rear, and therefore, information about the traffic conditions during the data collection period was obtained. A rich dataset of driver behavior was developed and analyzed as part of this research. The analysis findings relate the 3D sequence of driver motion and posture with the actual eye and head movement of drivers. The paper presents the research approach, summarizes findings, and provides recommendations for enhancing traffic safety. The findings are expected to assist in establishing monitoring guidelines for advanced driver assistance systems that take into account the driver’s body position and movements, rather than considering solely the vehicle position relative to other vehicles on the road. The results can also assist in developing appropriate alert mechanisms for increasing driver alertness.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Although significant advances have been done with respect to vehicle technology and roadway construction, driver behavior remains the number one contributing factor of traffic crashes worldwide. Studies show that one of the major causes of crashes is driver inattention. Driver inattention may occur when drivers are involved with secondary activities (e.g., texting, talking on the<span class=\"read-more-faq\"><a href=\"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/analyzing-3d-body-posture-activity-during-merging-and-lane-changing-maneuvers\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":212,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product\/244"}],"collection":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/comments?post=244"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media\/212"}],"wp:attachment":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media?parent=244"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}