{"id":246,"date":"2013-01-21T21:13:30","date_gmt":"2013-01-21T21:13:30","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=246"},"modified":"2020-06-27T21:13:50","modified_gmt":"2020-06-27T21:13:50","slug":"game-technology-to-enhance-locomotor-training-in-children-with-neurological-injuries","status":"publish","type":"product","link":"https:\/\/abarmpou.github.io/angelos\/page\/game-technology-to-enhance-locomotor-training-in-children-with-neurological-injuries\/","title":{"rendered":"Game technology to enhance locomotor training in children with neurological injuries."},"content":{"rendered":"<p>Locomotor training is a rehabilitation approach that optimizes task-specific sensory input during intense stepping practice. This approach is beneficial for adults with spinal cord injuries and is a promising intervention for children with neurological injuries. During locomotor training stepping and standing often are practiced for over an hour causing many children to lose motivation and become bored. As attention and focus wane, critical task-specific movements, such as upright trunk posture and reciprocal arm swing, become nearly impossible to evoke. Most importantly, these less intense and effective training sessions may compromise a child&#8217;s recovery. Incorporation of interactive and engaging video games is an innovative approach to enhance rehabilitation. Although commercial games have demonstrated therapeutic effects when applied to children with neurological injuries, most games do not consider the specific impairments that are common in children with neurological injuries and are not designed for use during locomotor training. We are therefore, developing an interactive video game, designed to enhance locomotor training in children with neurological injuries. We have assembled a multidisciplinary team with experts in neuroscience, rehabilitation, computer science, and video game design. We are using existing, affordable technologies to develop a game that is not only interactive and motivating to children, but that also is based on key determinants of walking control. Specifically, the video game will be controlled by critical features of locomotor training, which are based on the neural control of walking. These features, such as trunk posture, reciprocal arm swing, and stepping can be recorded during the use of the game to optimize the parameters of the game and to collect valuable data about the patient&#8217;s rehabilitation session.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Locomotor training is a rehabilitation approach that optimizes task-specific sensory input during intense stepping practice. This approach is beneficial for adults with spinal cord injuries and is a promising intervention for children with neurological injuries. During locomotor training stepping and standing often are practiced for over an hour causing many children to lose motivation and<span class=\"read-more-faq\"><a href=\"https:\/\/abarmpou.github.io/angelos\/page\/game-technology-to-enhance-locomotor-training-in-children-with-neurological-injuries\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":116,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product\/246"}],"collection":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/comments?post=246"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media\/116"}],"wp:attachment":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media?parent=246"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}