{"id":287,"date":"2023-04-18T23:36:13","date_gmt":"2023-04-18T23:36:13","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/?post_type=product&#038;p=287"},"modified":"2024-01-13T23:42:47","modified_gmt":"2024-01-13T23:42:47","slug":"prostate-capsule-segmentation-in-micro-ultrasound-images-using-deep-neural-networks","status":"publish","type":"product","link":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/prostate-capsule-segmentation-in-micro-ultrasound-images-using-deep-neural-networks\/","title":{"rendered":"Prostate Capsule Segmentation in Micro-Ultrasound Images Using Deep Neural Networks"},"content":{"rendered":"<p>Prostate cancer is the most common internal malignancy among males. Micro-Ultrasound is a promising imaging modality for cancer identification and computer-assisted visualization. Identifying the prostate capsule area is essential in active surveillance monitoring and treatment planning. In this paper, we present a pilot study that assesses prostate capsule segmentation using the U-Net deep neural network framework. To the best of our knowledge, this is the first study on prostate capsule segmentation in Micro-Ultrasound images. For our study, we collected multi-frame volumes of Micro-Ultrasound images, and then expert prostate cancer surgeons annotated the capsule border manually. The lack of clear boundaries and variation of shapes between patients make the task challenging, especially for novice Micro-Ultrasound operators. In total 2099 images were collected from 8 subjects, 1296 of which were manually annotated and were split into a training set (1008), a validation set (112), and a test set from a different subject (176). The performance of the model was evaluated by calculating the Intersection over Union (IoU) between the manually annotated area of the capsule and the segmentation mask computed from the trained deep neural network. The results demonstrate high IoU values for the training set (95.05%), the validation set (93.18%) and the test set from a separate subject (85.14%). In 10-fold cross-validation, IoU was 94.25%, and accuracy was 99%, validating the robustness of the model. Our pilot study demonstrates that deep neural networks can produce reliable segmentation of the prostate capsule in Micro-Ultrasound images and pave the road for the segmentation of other anatomical structures within the capsule, which will be the subject of our future studies.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Prostate cancer is the most common internal malignancy among males. Micro-Ultrasound is a promising imaging modality for cancer identification and computer-assisted visualization. Identifying the prostate capsule area is essential in active surveillance monitoring and treatment planning. In this paper, we present a pilot study that assesses prostate capsule segmentation using the U-Net deep neural network<span class=\"read-more-faq\"><a href=\"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/page\/prostate-capsule-segmentation-in-micro-ultrasound-images-using-deep-neural-networks\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":288,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product\/287"}],"collection":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/comments?post=287"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media\/288"}],"wp:attachment":[{"href":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/wp-json\/wp\/v2\/media?parent=287"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}