{"id":308,"date":"2024-02-13T19:04:33","date_gmt":"2024-02-13T19:04:33","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/projects\/angelos\/?post_type=product&#038;p=308"},"modified":"2024-02-19T19:37:41","modified_gmt":"2024-02-19T19:37:41","slug":"investigating-how-interaction-with-physical-objects-within-virtual-environments-affects-knowledge-acquisition-and-recall","status":"publish","type":"product","link":"https:\/\/codingplusfun.com\/page\/investigating-how-interaction-with-physical-objects-within-virtual-environments-affects-knowledge-acquisition-and-recall\/","title":{"rendered":"Investigating how interaction with physical objects within virtual environments affects knowledge acquisition and recall"},"content":{"rendered":"<p>The use of passive haptics in virtual reality environments has been shown to improve procedural learning across various application domains such as first responders training, kayaking, and others (Calandra at al. 2023, Barmpoutis et al. 2020). In this paper we want to go one step further and quantify the effect of passive haptics on knowledge acquisition and recall.  We developed a specialized virtual reality application for learning various chemical compounds and their components. Participants engaged in activities that involved precise mixing and proportioning of chemical components to form targeted compounds (see Figure 1). Employing an A-B test framework, participants were randomly assigned to two identical virtual reality environments, differing only in the substitution of the VR controller with a physical jar.<\/p>\n<p>Post-study surveys were administered to gauge user perceptions regarding interaction accuracy and realism, as well as their ability to recall acquired knowledge (specifically, the list of ingredients) from their virtual experience. This pilot study, conducted at the University of Florida Reality Lab, involved 12 subjects. Rigorous statistical analyses, including chi-square tests, were performed on the collected data, with detailed results outlined in this paper.<\/p>\n<p>Two key findings emerged from the study: (a) the presence of the physical jar significantly heightened perceived interaction accuracy, particularly in precise liquid pouring tasks, and (b) users exhibited a remarkable 33% improvement in knowledge recall when utilizing the physical jar as opposed to a conventional VR controller. These results establish a compelling, statistically significant correlation between the integration of passive haptic objects in VR and knowledge acquisition and recall. Furthermore, this study lays the groundwork for a larger-scale study in the future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The use of passive haptics in virtual reality environments has been shown to improve procedural learning across various application domains such as first responders training, kayaking, and others (Calandra at al. 2023, Barmpoutis et al. 2020). In this paper we want to go one step further and quantify the effect of passive haptics on knowledge<span class=\"read-more-faq\"><a href=\"https:\/\/codingplusfun.com\/page\/investigating-how-interaction-with-physical-objects-within-virtual-environments-affects-knowledge-acquisition-and-recall\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":309,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/product\/308"}],"collection":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/comments?post=308"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/media\/309"}],"wp:attachment":[{"href":"https:\/\/codingplusfun.com\/wp-json\/wp\/v2\/media?parent=308"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}