{"id":337,"date":"2024-02-12T16:37:06","date_gmt":"2024-02-12T16:37:06","guid":{"rendered":"https:\/\/abarmpou.github.io/angelos\/?post_type=product&#038;p=337"},"modified":"2024-08-04T15:44:44","modified_gmt":"2024-08-04T15:44:44","slug":"enhancing-museum-experience-with-virtual-reality-situating-3d-museum-collections-in-context","status":"publish","type":"product","link":"https:\/\/abarmpou.github.io/angelos\/page\/enhancing-museum-experience-with-virtual-reality-situating-3d-museum-collections-in-context\/","title":{"rendered":"Enhancing Museum Experience with Virtual Reality: Situating 3D Museum Collections in Context"},"content":{"rendered":"<p>Recent advancements in photogrammetry and 3D LiDAR scanners have led to a noticeable increase in the creation of 3D scans of museum artifacts. This trend has opened up new possibilities for museums to create interactive and immersive experiences using virtual reality (VR). In collaboration with the Florida Natural History Museum, we have developed an interactive VR game that utilizes the extensive 3D digital collection of the Florida Museum. The goal is to enhance the traditional museum experience by immersing visitors in dynamic VR environments that showcase 3D museum collections within context. Specifically, our VR game highlights 3D scans of endangered species of underwater creatures in the ocean. Children can swim alongside these sea creatures while an AI conversational agent provides scientific insights. Our VR game was showcased to the public at the Florida Natural History Museum during a public outreach event, attracting visits from three K-12 school trips. We conducted field observations to evaluate children’s interactions with the VR game and conducted semi-structured interviews with children’s guardians as well as museum staff. The findings from our observations emphasized the importance of shared experiences among visitors, which could be facilitated by projecting the VR gameplay on a large screen to mitigate the isolated nature of the HMD VR experience limitations. Additionally, museum staff emphasized the significance of considering visitor traffic when designing VR experiences in museum settings. The findings also highlighted a preference for seated experiences over standing ones due to safety concerns related to children colliding with others and museum artifacts. This paper provides an overview of our design process and the challenges of implementing HMD VR in museum settings, offering valuable insights for future endeavors aimed at designing public VR educational experiences targeting children.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Recent advancements in photogrammetry and 3D LiDAR scanners have led to a noticeable increase in the creation of 3D scans of museum artifacts. This trend has opened up new possibilities for museums to create interactive and immersive experiences using virtual reality (VR). In collaboration with the Florida Natural History Museum, we have developed an interactive<span class=\"read-more-faq\"><a href=\"https:\/\/abarmpou.github.io/angelos\/page\/enhancing-museum-experience-with-virtual-reality-situating-3d-museum-collections-in-context\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":339,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product\/337"}],"collection":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/comments?post=337"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media\/339"}],"wp:attachment":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media?parent=337"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}