{"id":357,"date":"2025-02-19T18:57:01","date_gmt":"2025-02-19T18:57:01","guid":{"rendered":"https:\/\/abarmpou.github.io/angelos\/?post_type=product&#038;p=357"},"modified":"2025-02-21T13:05:08","modified_gmt":"2025-02-21T13:05:08","slug":"integrated-telehealth-and-extended-reality-to-enhance-home-exercise-adherence-following-total-hip-and-knee-arthroplasty","status":"publish","type":"product","link":"https:\/\/abarmpou.github.io/angelos\/page\/integrated-telehealth-and-extended-reality-to-enhance-home-exercise-adherence-following-total-hip-and-knee-arthroplasty\/","title":{"rendered":"Integrated Telehealth and Extended Reality to Enhance Home Exercise Adherence Following Total Hip and Knee Arthroplasty"},"content":{"rendered":"<p>Nearly one million total hip and knee arthroplasties (THA\/TKA) are performed annually in the United States, with most patients discharged home and prescribed home exercise programs (HEPs) to enhance lower extremity function. Traditional paper-based HEPs, while accessible and low-cost, often lack engagement and real-time feedback, which are critical for adherence and performance optimization. Extended reality (XR) and telehealth (TH) systems offer promising solutions, combining engagement and feedback, though each has limitations. To address these gaps, we designed and executed a pilot study that compared exercise performance in individuals with THA\/TKA using a conventional paper-based HEP versus a proof-of-concept system, dubbed Tele-PhyT, that included the ideal characteristics of a future XR technology that would enable seamless HEP-TH systems, with robust marker-less full body tracking, real-time visual feedback, and performance quantification. The pilot study used a randomized cross-over design and targeted two types of users: therapists and patients. Participants favored Tele-PhyT for its real-time feedback and ease of use, and noted its potential to improve HEP adherence and exercise accuracy.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nearly one million total hip and knee arthroplasties (THA\/TKA) are performed annually in the United States, with most patients discharged home and prescribed home exercise programs (HEPs) to enhance lower extremity function. Traditional paper-based HEPs, while accessible and low-cost, often lack engagement and real-time feedback, which are critical for adherence and performance optimization. Extended reality<span class=\"read-more-faq\"><a href=\"https:\/\/abarmpou.github.io/angelos\/page\/integrated-telehealth-and-extended-reality-to-enhance-home-exercise-adherence-following-total-hip-and-knee-arthroplasty\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":358,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product\/357"}],"collection":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/comments?post=357"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media\/358"}],"wp:attachment":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media?parent=357"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}