{"id":73,"date":"2020-02-12T15:04:58","date_gmt":"2020-02-12T15:04:58","guid":{"rendered":"https:\/\/research.dwi.ufl.edu\/people\/angelos\/?post_type=product&#038;p=73"},"modified":"2020-05-12T12:54:04","modified_gmt":"2020-05-12T12:54:04","slug":"custom-virtual-reality-system-with-real-time-therapist-interactions-to-enhance-home-exercise-performance-and-adherence","status":"publish","type":"product","link":"https:\/\/abarmpou.github.io/angelos\/page\/custom-virtual-reality-system-with-real-time-therapist-interactions-to-enhance-home-exercise-performance-and-adherence\/","title":{"rendered":"Custom Virtual Reality System with Real-Time Therapist Interactions to Enhance Home Exercise Performance and Adherence"},"content":{"rendered":"<p><strong>Purpose\/Hypothesis:<\/strong><br \/>\nFollowing lower extremity (LE) joint replacement, patients are increasingly prescribed virtual reality-based home exercise programs (HEP). One goal of virtual reality (VR) use is to promote HEP adherence. Exercise adherence, as well as exercise performance, is increased with human interaction and real-time therapist feedback, which is not commonly incorporated in commercially available VR systems. To address these limitations, a custom VR system was developed using an infrared camera for motion tracking, avatar streaming, and real-time remote therapist interactions. The primary aim of this study was to evaluate the use of this custom VR system on HEP performance in adults post LE joint replacement. We also examined patient and therapist opinions of VR system feedback features and ability to improve HEP adherence.<\/p>\n<p><strong>Number of Subjects:<\/strong><br \/>\n14 patients (11 female; 62.5±7.5 years) with unilateral hip (n=6) or knee (n=8) replacements (4.6±5.9 months post-surgery) and 11 therapists (6 PT, 4 OT, 1 COTA; female; &gt;2 yrs experience) participated.<\/p>\n<p><strong>Materials\/Methods:<\/strong><br \/>\nSubjects completed two random-ordered LE exercise conditions using either the custom VR system or a conventional HEP with diagrams and written instructions while therapists observed remotely via video streaming. Four standing exercises were performed (hip flexion, abduction, extension, squats). Instructions and verbal feedback were standardized, and 3-D LE motions were recorded. Exercise performance was assessed by calculating peak joint angles and movement velocities. The effect of remote therapist interaction and verbal feedback on exercise performance during the VR condition was assessed by calculation of peak joint angles during aberrant, compensatory movements (i.e. trunk lean). Exercise performance during the two conditions was compared using paired t-tests. Patient and therapist preferences were assessed using standardized questionnaires with open-ended and Likert scale-based items.<\/p>\n<p><strong>Results:<\/strong><br \/>\nPeak joint angles during the two conditions were not different (p&gt;.05), but movements were slower with VR use for 3 of 4 exercises (p&lt;.05) and compensations were reduced with remote therapist interactions and verbal feedback. 100% of patient and therapist participants reported preferences for remote interactions including verbal feedback and interactions with streaming avatars to display real-time movements. 79% of patients and 91% of therapists reported agreement that the VR system could improve HEP adherence.<\/p>\n<p><strong>Conclusion:<\/strong><br \/>\nA custom VR system that incorporates real-time remote therapist interactions improved HEP performance in individuals post LE joint replacement. Both patients and therapists reported high preferences for real-time interactions.<\/p>\n<p><strong>Clinical Relevance:<\/strong><br \/>\nVR systems should consider the role of real-time therapist interactions to promote engagement and adherence to HEPs, as well as provide opportunity for feedback to enhance exercise performance. Further, web-based systems can allow for multi-user group exercise sessions and engagement for those in ru<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Purpose\/Hypothesis: Following lower extremity (LE) joint replacement, patients are increasingly prescribed virtual reality-based home exercise programs (HEP). One goal of virtual reality (VR) use is to promote HEP adherence. Exercise adherence, as well as exercise performance, is increased with human interaction and real-time therapist feedback, which is not commonly incorporated in commercially available VR systems.<span class=\"read-more-faq\"><a href=\"https:\/\/abarmpou.github.io/angelos\/page\/custom-virtual-reality-system-with-real-time-therapist-interactions-to-enhance-home-exercise-performance-and-adherence\/\">Read More<\/a><\/span><\/p>\n","protected":false},"featured_media":74,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product\/73"}],"collection":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/product"}],"about":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/types\/product"}],"replies":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/comments?post=73"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media\/74"}],"wp:attachment":[{"href":"https:\/\/abarmpou.github.io/angelos\/wp-json\/wp\/v2\/media?parent=73"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}